terraform plan 

```tf
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.projects.module.automation-bucket["wshop01-p-154457"].google_storage_bucket.bucket[0] will be created
  + resource "google_storage_bucket" "bucket" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "ten21-wshop01-p-154457-tf-state"
      + project                     = "ten21-prod-iac-core-0"
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = false
        }

      + website (known after apply)
    }

  # module.projects.module.automation-bucket["wshop01-p-154457"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectCreator"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-wshop01-p-154457-tf-state"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectCreator"
    }

  # module.projects.module.automation-bucket["wshop01-p-154457"].google_storage_bucket_iam_binding.authoritative["roles/storage.objectViewer"] will be created
  + resource "google_storage_bucket_iam_binding" "authoritative" {
      + bucket  = "ten21-wshop01-p-154457-tf-state"
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-wshop01-p-154457-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com",
          + "serviceAccount:ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + role    = "roles/storage.objectViewer"
    }

  # module.projects.module.automation-service-accounts["wshop01-p-154457/ro"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-wshop01-p-154457-ro"
      + description  = "Read-only automation sa for team cloudops."
      + disabled     = false
      + display_name = "Service account ro for wshop01-p-154457."
      + email        = "ten21-wshop01-p-154457-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-wshop01-p-154457-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.projects.module.automation-service-accounts["wshop01-p-154457/rw"].google_service_account.service_account[0] will be created
  + resource "google_service_account" "service_account" {
      + account_id   = "ten21-wshop01-p-154457-rw"
      + description  = "Read/write automation sa for team cloudops."
      + disabled     = false
      + display_name = "Service account rw for wshop01-p-154457."
      + email        = "ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "ten21-prod-iac-core-0"
      + unique_id    = (known after apply)
    }

  # module.projects.module.hierarchy-folder-lvl-1["cloudops"].google_folder_iam_binding.authoritative["roles/viewer"] will be updated in-place
  ~ resource "google_folder_iam_binding" "authoritative" {
        id      = "folders/437249989/roles/viewer"
      ~ members = [
          - "deleted:group:gcp-terraform-workshop@tentwentyone.io?uid=503046110851377110182",
          + "group:gcp-terraform-workshop@tentwentyone.io",
            # (8 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.projects.module.projects["wshop01-p-154457"].google_essential_contacts_contact.contact["gcp.billing.tentwentyone@tentwentyone.io"] will be created
  + resource "google_essential_contacts_contact" "contact" {
      + email                               = "gcp.billing.tentwentyone@tentwentyone.io"
      + id                                  = (known after apply)
      + language_tag                        = "en"
      + name                                = (known after apply)
      + notification_category_subscriptions = [
          + "BILLING",
        ]
      + parent                              = "projects/ten21-wshop01-p-154457"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project.project[0] will be created
  + resource "google_project" "project" {
      + auto_create_network = false
      + billing_account     = "01C8D5-E4EA95-F2D624"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "gcp-cloudops"
        }
      + folder_id           = "636596697914"
      + id                  = (known after apply)
      + labels              = {
          + "team" = "gcp-cloudops"
        }
      + name                = "ten21-wshop01-p-154457"
      + number              = (known after apply)
      + project_id          = "ten21-wshop01-p-154457"
      + terraform_labels    = {
          + "goog-terraform-provisioned" = "true"
          + "team"                       = "gcp-cloudops"
        }
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_iam_member.service_agents["compute-system"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/compute.serviceAgent"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_iam_member.service_agents["container-engine-robot"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/container.serviceAgent"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_iam_member.service_agents["gkenode"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/container.defaultNodeServiceAgent"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_iam_member.service_agents["monitoring-notification"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/monitoring.notificationServiceAgent"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_iam_member.service_agents["service-networking"] will be created
  + resource "google_project_iam_member" "service_agents" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/servicenetworking.serviceAgent"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["cloudbilling.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "cloudbilling.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "compute.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "container.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "iam.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "logging.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "monitoring.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "servicenetworking.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["serviceusage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "serviceusage.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service.project_services["stackdriver.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = false
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = "ten21-wshop01-p-154457"
      + service                    = "stackdriver.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service_identity.default["container.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-wshop01-p-154457"
      + service = "container.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service_identity.default["monitoring.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-wshop01-p-154457"
      + service = "monitoring.googleapis.com"
    }

  # module.projects.module.projects["wshop01-p-154457"].google_project_service_identity.default["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service_identity" "default" {
      + email   = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "ten21-wshop01-p-154457"
      + service = "servicenetworking.googleapis.com"
    }

  # module.projects.module.projects-iam["lab-d-121432"].google_project_iam_binding.authoritative["roles/viewer"] will be updated in-place
  ~ resource "google_project_iam_binding" "authoritative" {
        id      = "ten21-lab-d-121432/roles/viewer"
      ~ members = [
          - "deleted:group:gcp-terraform-workshop@tentwentyone.io?uid=503046110851377110182",
          + "group:gcp-terraform-workshop@tentwentyone.io",
            # (9 unchanged elements hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_compute_shared_vpc_service_project.shared_vpc_service[0] will be created
  + resource "google_compute_shared_vpc_service_project" "shared_vpc_service" {
      + host_project    = "ten21-dev-net-spoke-0"
      + id              = (known after apply)
      + service_project = "ten21-wshop01-p-154457"
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_project_iam_binding.authoritative["roles/owner"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "serviceAccount:ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/owner"
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_project_iam_binding.authoritative["roles/resourcemanager.projectIamAdmin"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:tto-workshop-admins@tentwentyone.io",
        ]
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_project_iam_binding.authoritative["roles/viewer"] will be created
  + resource "google_project_iam_binding" "authoritative" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = [
          + "group:tto-workshop-admins@tentwentyone.io",
          + "serviceAccount:ten21-wshop01-p-154457-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com",
        ]
      + project = "ten21-wshop01-p-154457"
      + role    = "roles/viewer"
    }

  # module.projects.module.projects-iam["wshop01-p-154457"].google_project_iam_member.shared_vpc_host_iam["group:gcp-devops@tentwentyone.io"] will be created
  + resource "google_project_iam_member" "shared_vpc_host_iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "group:gcp-devops@tentwentyone.io"
      + project = "ten21-dev-net-spoke-0"
      + role    = "roles/compute.networkUser"
    }

Plan: 30 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  - factories_config_debug = {
      - budgets            = {
          - billing_account       = "01C8D5-E4EA95-F2D624"
          - budgets_data_path     = "data/budgets"
          - notification_channels = {}
        }
      - context            = {
          - folder_ids        = {}
          - iam_principals    = {}
          - tag_values        = {}
          - vpc_host_projects = {}
        }
      - folders_data_path  = "data/hierarchy"
      - projects_data_path = "data/projects"
    } -> null
  ~ projects               = {
      + wshop01-p-154457 = {
          + automation = {
              + bucket           = "ten21-wshop01-p-154457-tf-state"
              + service_accounts = {
                  + ro = "ten21-wshop01-p-154457-ro@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                  + rw = "ten21-wshop01-p-154457-rw@ten21-prod-iac-core-0.iam.gserviceaccount.com"
                }
            }
          + number     = (known after apply)
          + project    = {
              + alert_ids                  = {}
              + custom_role_id             = {}
              + custom_roles               = {}
              + default_service_accounts   = {
                  + compute = (known after apply)
                  + gae     = "ten21-wshop01-p-154457@appspot.gserviceaccount.com"
                }
              + id                         = "ten21-wshop01-p-154457"
              + name                       = "ten21-wshop01-p-154457"
              + network_tag_keys           = {}
              + network_tag_values         = {}
              + notification_channel_names = {}
              + notification_channels      = {}
              + number                     = (known after apply)
              + project_id                 = "ten21-wshop01-p-154457"
              + quota_configs              = {}
              + quotas                     = {}
              + service_agents             = {
                  + cloudservices           = {
                      + api          = null
                      + display_name = "Google APIs Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = null
                    }
                  + cloudsvc                = {
                      + api          = null
                      + display_name = "Google APIs Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = null
                    }
                  + compute                 = {
                      + api          = "compute.googleapis.com"
                      + display_name = "Compute Engine Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = "roles/compute.serviceAgent"
                    }
                  + compute-system          = {
                      + api          = "compute.googleapis.com"
                      + display_name = "Compute Engine Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = "roles/compute.serviceAgent"
                    }
                  + compute-usage           = {
                      + api          = "compute.googleapis.com"
                      + display_name = "Compute Usage Export Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = null
                    }
                  + container               = {
                      + api          = "container.googleapis.com"
                      + display_name = "Kubernetes Engine Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = true
                      + role         = "roles/container.serviceAgent"
                    }
                  + container-engine        = {
                      + api          = "container.googleapis.com"
                      + display_name = "Kubernetes Engine Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = true
                      + role         = "roles/container.serviceAgent"
                    }
                  + container-engine-robot  = {
                      + api          = "container.googleapis.com"
                      + display_name = "Kubernetes Engine Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = true
                      + role         = "roles/container.serviceAgent"
                    }
                  + gcp-ri-identitypool     = {
                      + api          = "iam.googleapis.com"
                      + display_name = "Identity Pool Resource Identity"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = null
                    }
                  + gkenode                 = {
                      + api          = "container.googleapis.com"
                      + display_name = "Kubernetes Engine Node Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = "roles/container.defaultNodeServiceAgent"
                    }
                  + logging                 = {
                      + api          = "logging.googleapis.com"
                      + display_name = "Cloud Logging Service Account"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = "roles/logging.serviceAgent"
                    }
                  + monitoring              = {
                      + api          = "monitoring.googleapis.com"
                      + display_name = "Monitoring Service Account"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = true
                      + role         = "roles/monitoring.notificationServiceAgent"
                    }
                  + monitoring-deprecated   = {
                      + api          = "monitoring.googleapis.com"
                      + display_name = "Deprecated Monitoring Service Account"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = false
                      + role         = null
                    }
                  + monitoring-notification = {
                      + api          = "monitoring.googleapis.com"
                      + display_name = "Monitoring Service Account"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = true
                      + role         = "roles/monitoring.notificationServiceAgent"
                    }
                  + service-networking      = {
                      + api          = "servicenetworking.googleapis.com"
                      + display_name = "Service Networking Service Agent"
                      + email        = (known after apply)
                      + iam_email    = (known after apply)
                      + is_primary   = true
                      + role         = "roles/servicenetworking.serviceAgent"
                    }
                }
              + services                   = [
                  + "cloudbilling.googleapis.com",
                  + "cloudresourcemanager.googleapis.com",
                  + "compute.googleapis.com",
                  + "container.googleapis.com",
                  + "iam.googleapis.com",
                  + "logging.googleapis.com",
                  + "monitoring.googleapis.com",
                  + "servicenetworking.googleapis.com",
                  + "serviceusage.googleapis.com",
                  + "stackdriver.googleapis.com",
                ]
              + sink_writer_identities     = {}
              + tag_keys                   = {}
              + tag_values                 = {}
            }
          + project_id = "ten21-wshop01-p-154457"
        }
        # (1 unchanged attribute hidden)
```